In [24]:
import pandas as pd
from sklearn.model_selection import train_test_split

In [28]:
split = "/home/evgenii/Desktop/ml_hw/NamePrompt/data/normalized_clipped.csv"

In [29]:
split = pd.read_csv(split)

In [30]:
split

,name_1,name_2,is_duplicate
0,gerdau ameristeel,amster s.a .,0
1,ia s.a d cv,bobinas calidad s rl cv,0
2,powersource,sto corp,0
3,trelleborg santana parnaiba ind comer solucoes,ktn,0
4,qingdao hymd trade .,indaco sp,0
...,...,...,...
7814,bridgestone china research development .,bridgestone firestone brasil,1
7815,tokyo zairyo m sdn bhd,tokyo zairyo .,1
7816,michelin na asrc,michelin india private .,1
7817,michelin group,michelin siam .,1
7818,arlanxeo group,arlanxeo,1

In [31]:
X = split[["name_1", "name_2"]]

In [32]:
y = split["is_duplicate"]

In [33]:
X

,name_1,name_2
0,gerdau ameristeel,amster s.a .
1,ia s.a d cv,bobinas calidad s rl cv
2,powersource,sto corp
3,trelleborg santana parnaiba ind comer solucoes,ktn
4,qingdao hymd trade .,indaco sp
...,...,...
7814,bridgestone china research development .,bridgestone firestone brasil
7815,tokyo zairyo m sdn bhd,tokyo zairyo .
7816,michelin na asrc,michelin india private .
7817,michelin group,michelin siam .
7818,arlanxeo group,arlanxeo

In [34]:
y

0       0
1       0
2       0
3       0
4       0
       ..
7814    1
7815    1
7816    1
7817    1
7818    1
Name: is_duplicate, Length: 7819, dtype: int64

In [35]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)
train_split = pd.concat([X_train, y_train], axis=1)
val_split = pd.concat([X_test, y_test], axis=1)

In [36]:
val_split.to_csv("/home/evgenii/Desktop/ml_hw/NamePrompt/data/val_final.csv", index=False)
train_split.to_csv("/home/evgenii/Desktop/ml_hw/NamePrompt/data/train_final.csv", index=False)